package top.yunxy.socket.flutter_socket.jtt;

import top.yunxy.socket.flutter_socket.util.DataTypeUtil;
import top.yunxy.socket.flutter_socket.util.HexUtil;

public enum MessageType {
    T0001(0x0001, "终端通用应答"),
    T8001(0x8001, "平台通用应答"),
    T0002(0x0002, "终端心跳"),
    T8003(0x8003, "补传分包请求"),
    T0100(0x0100, "终端注册"),
    T8100(0x8100, "终端注册应答"),
    T0003(0x0003, "终端注销"),
    T0102(0x0102, "终端鉴权"),
    T8103(0x8103, "设置终端参数"),
    T8104(0x8104, "查询终端参数"),
    T0104(0x0104, "查询终端参数应答"),
    T8105(0x8105, "终端控制"),
    T8106(0x8106, "查询指定终端参数"),
    T8107(0x8107, "查询终端属性"),
    T0107(0x0107, "查询终端属性应答"),
    T8108(0x8108, "下发终端升级包"),
    T0108(0x0108, "终端升级结果通知"),
    T0200(0x0200, "位置信息汇报"),
    T0201(0x0201, "位置信息查询"),
    T8202(0x8202, "位置信息查询应答"),
    T8203(0x8203, "临时位置跟踪控制"),
    T8300(0x8300, "人工确认报警消息"),
    T8301(0x8301, "文本信息下发"),
    T0301(0x0301, "事件设置"),
    T8302(0x8302, "事件报告"),
    T0302(0x0302, "提问下发"),
    T8303(0x8303, "提问应答"),
    T0303(0x0303, "信息点播菜单设置"),
    T8304(0x8304, "信息点播/取消"),
    T8400(0x8400, "信息服务"),
    T8401(0x8401, "电话回拨"),
    T8500(0x8500, "设置电话本"),
    T0500(0x0500, "车辆控制"),
    T8600(0x8600, "车辆控制应答"),
    T8601(0x8601, "设置圆形区域"),
    T8602(0x8602, "删除圆形区域"),
    T8603(0x8603, "设置矩形区域"),
    T8604(0x8604, "删除矩形区域"),
    T8605(0x8605, "设置多边形区域"),
    T8606(0x8606, "删除多边形区域"),
    T8607(0x8607, "设置路线"),
    T8700(0x8700, "删除路线"),
    T0700(0x0700, "行驶记录仪数据采集命令"),
    T8701(0x8701, "行驶记录仪数据上传"),
    T0701(0x0701, "行驶记录仪参数下传命令"),
    T0702(0x0702, "电子运单上报"),
    T8702(0x8702, "驾驶员身份信息采集上报"),
    T0704(0x0704, "上报驾驶员身份信息请求"),
    T8805(0x8805, "定位数据批量上传"),
    T0705(0x0705, "CAN总线数据上传"),
    T0800(0x0800, "多媒体事件信息上传"),
    T0801(0x0801, "多媒体数据上传"),
    T8800(0x8800, "多媒体数据上传应答"),
    T8801(0x8801, "摄像头立即拍摄命令"),
    T0805(0x0805, "摄像头立即拍摄命令应答"),
    T8802(0x8802, "存储多媒体数据检索"),
    T0802(0x0802, "存储多媒体数据检索应答"),
    T8803(0x8803, "存储多媒体数据上传"),
    T8804(0x8804, "录音开始命令"),
    T8900(0x8900, "数据下行透传"),
    T0900(0x0900, "数据上行透传"),
    T0901(0x0901, "数据压缩上报"),
    T8A00(0x8A00, "平台RSA公钥"),
    T0A00(0x0A00, "终端RSA公钥"),
    T0F01(0x0F01, "车辆状态上报"),
    T9101(0x9101, "实时音视频传输请求"),
    T9102(0x9102, "实时音视频传输控制");

    private int key;
    private String label;

    MessageType(int key, String label) {
        this.key = key;
        this.label = label;
    }

    public int getKey() {
        return key;
    }

    public String getLabel() {
        return label;
    }

    public static MessageType get(int msgId) {
        for (MessageType item : MessageType.values()) {
            if(item.key == msgId) {
                return item;
            }
        }
        return null;
    }

    @Override
    public String toString() {
        return label + "(" + HexUtil.encode(DataTypeUtil.toWORD(key)) + ")";
    }
}
